/*
 * FanControl v2.0 - Fan Kitchen v1.0
 *
 * Created: 12.01.2023
 *  Author: Vadim Kulakov, vad7@yahoo.com
 *
 * ATtiny44A/84A
 *
 * Radio nRF24L01+
 * IR TL1838V
 * Relay G3MB-202P * 4
 * VCC 5V, 3.3V for nRF24
 */ 
#define F_CPU 8000000UL
// Fuses: BODLEVEL = 1.8V (BODLEVEL[2:0] = 110), RSTDISBL=0, EESAVE=0

//#define DEBUG_PROTEUS

#include <stdlib.h>
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/sleep.h>
#include <avr/wdt.h>
#include <avr/pgmspace.h>
#include <avr/eeprom.h>
#include <util/delay.h>
#include <util/atomic.h>

const char ProgramID[] PROGMEM = "Fan Kitchen v1";

#define KEY							(1<<PORTB3)
#define KEY_PRESSING				!(PINB & KEY)
#define KEY_SETUP					PORTB |= KEY

#define COOKER_HOOD					// есть кухонная вытяжка
#ifdef COOKER_HOOD
#define FanCooker_PORT				PORTA
#define FanCooker_DDR				DDRA
#define FanCooker_PORT_ADDR			(0x20 + FanCooker_PORT)
#define FanCooker_PIN				PINA
#define FanCooker_Out1				(1<<PORTA7)	// F1.1
#define FanCooker_Out2				(1<<PORTA0)	// F2.1
#define FanCooker_OFF				FanCooker_PORT &= ~(FanCooker_Out1 | FanCooker_Out2)
#define FanCooker_Out2_ON			FanCooker_PORT |= FanCooker_Out2
#define FanCooker_Out2_OFF			FanCooker_PORT &= ~FanCooker_Out2
#endif

#define Fan_PORT					PORTB
#define Fan_DDR						DDRB
#define Fan_PORT_ADDR				(0x20 + Fan_PORT)
#define Fan_PIN						PINB
#define Fan_Out1					(1<<PORTB1)	// F1.2
#define Fan_Out2					(1<<PORTB0)	// F2.2
#define Fan_OFF						Fan_PORT &= ~(Fan_Out1 | Fan_Out2)

#define LED1_ON_BEFORE_RESET		LED1_DDR |= LED1
#endif

//const uint8_t FanPORTS[] PROGMEM = { Fan_Speed1, Fan_Speed2,  } // FanSpeed_1 - FanCookerSpeed_3

#define Fan_DamperSwitchTime		25	// sec
#define FANS_SLEEP_STEP				30	// minutes
#define FAN_IDXS					3	// How many speeds indices does each fan have

//uint8_t FanSpeed					= 0; // Current fan speed
//uint8_t FanSleep					= 0; // Current fan sleep
uint8_t SleepTimer					= 0; // *FANS_SLEEP_STEP minutes
uint8_t OffTimer					= 0; // sec
int8_t  OutPeriod;					// Fans period of regulation (number 1/100Hz halfwaves)
uint8_t* FanPortADDR;				// global address of PORTA/PORTB for current fan 
uint8_t  FanPortPIN;				// Turn on PORT value for current fan

#define	IR_MAX_CONTROLS				10 // Max different remote controls
#define	IR_PULSES_MIN				8 // IR packet minimum pulses
enum {
	IR_WAITING = 0,
	IR_START,
	IR_READING, 
	IR_DONE
};
enum {
	IR_Key_FanUp = 0,		// Fan (from OFF - speed 3)
	IR_Key_FanDown,			// Fan (from OFF - speed 1)
	IR_Key_CookerUp,		// or right - FanCooker + (from OFF - speed 3)
	IR_Key_CookerDown,		// or left  - FanCooker - (from OFF - speed 1)
	IR_Key_Off,
	IR_Key_CookerLight,
	IR_Key_Setup,
	IR_Keys_Total			// number of keys
};
uint8_t IR_Status					= IR_WAITING;
uint8_t IR_Cnt						= 0;
uint16_t IR_LastDuration;
uint16_t IR_Hash;

uint8_t IRRepeatDelay				= 0;	// *0.1 sec
uint8_t IRRepeatCnt					= 0;
uint16_t IR_Hash					= 0;
typeof(IR_Hash) IRHash_Last			= 0;
uint8_t Key1Pressed					= 0;	// Time
uint8_t Key1Pause					= 0;
volatile uint8_t Timer				= 0;	// sec
uint8_t TimerSecCnt					= 0;
uint8_t Flags;
uint8_t FanOn						= 0;	// 0 - off, 1..6 - FanSpeed_1 ... FanCookerSpeed_3
uint8_t FanSpeed					= 0;	// current speed
uint8_t FanOnNext					= 0;	// after timeouts next Fan speed
uint8_t FanOnLast					= 0;	// before FanOnNext
uint8_t FanOnNextCnt				= 0;	// sec
uint8_t SetupItem					= 0;
uint8_t Setup						= 0;	// Setup enum
uint8_t CookerLight_force_on		= 0;
uint8_t SetFanSpeed_by_CO2			= 0;	// 1 - change due to CO2 level

enum {
	fSetup_Off = 0,
	fSetup_IR,
	fSetup_Speed
};

#define REPEAT_TIMES_SETUP_SPEED	3
#define REPEAT_TIMES_SETUP_IR		5
#define IR_REPEAT_TIMEOUT			2		// *0.1 sec
#define IR_REPEAT_TIMEOUT_SETUP		50		// *0.1 sec

// EEPROM.Flags:
#define f_NRF24						(1<<0)	// Present nRF24L01
#define f_FanHiSpeed				(1<<1)	// Present Fan Hi speed - second motor coil - Port: FAN2.2 (Fan_Out2)
#define f_FanCookerHiSpeed			(1<<2)	// Present FanCooker Hi speed - second motor coil - Port: FAN2.1 (FanCooker_Out2)
#define f_CookerLamp_FanOut2		(1<<3)	// Present Cooker Lamp on Fan out 2 (FAN2.2)
#define f_CookerLamp_CookerOut2		(1<<4)	// Present Cooker Lamp on CookerFan out 2 (FAN1.2)
#define f_FanDamper					(1<<5)	// Present Fan Damper - Port: FAN2.2 (Fan_Out2). Damper is ON all time when Fan is ON
//#define f_FanCookerDamper			(1<<6)	// Present FanCooker - Port: FAN2.2 (Fan_Out2). Damper is ON all time when Fan is ON
//#define f_Damper					(1<<7)	// Central damper - one for all fans (FAN2.2)

struct _EEPROM {
/* 0*/	uint8_t _OSCCAL;
/* 1*/	uint8_t Flags;				// Flags
/* 2*/	uint8_t RF_Address;			// nRF24 address LSB
/* 3*/	uint8_t RF_Channel;			// nRF24 channel
/* 4*/	uint16_t CO2_threshold1;	// CO2 threshold to start Fan speed 1 (if FanCooker is OFF)
/* 6*/	uint16_t CO2_threshold2;	// CO2 threshold to start Fan speed 2 (if FanCooker is OFF)
/* 8*/	uint16_t CO2_threshold3;	// CO2 threshold to start Fan speed 3 (if FanCooker is OFF)
/*10*/	uint8_t FanStartupMaxSpTime;// sec forced max speed 
/*11*/	uint8_t FanShutdownTime;	// Fan turning off time (used for switch from Fan to FanCooker), sec
/*12*/	uint8_t FanCookerStartupMaxSpTime; // sec forced max speed 
/*13*/	uint8_t FanCookerShutdownTime;// FanCooker turning off time (used for switch from FanCooker to Fan), sec
/*14*/	uint8_t FanSleep;			// Auto sleep time, *FANS_SLEEP_STEP
/*15*/	uint8_t FanCookerSleep;		// Auto sleep time, *FANS_SLEEP_STEP
/*16*/	uint8_t SpeedInitIdx;	// Power up Fans speed index: 0 - all off, 1 - Fan speed1, 2 - Fan speed2, 3 - Fan speed3, 4 - FanCooker speed 1, 5 - FanCooker speed 2, 6 - FanCooker speed 3
/*17*/	uint8_t SpeedKeyIdx;		// When key pressed
/*18*/	uint8_t OutPeriod;			// Fans period of regulation (number 1/100Hz halfwaves)
// Idx: From 0 (off) to OutPeriod * 2, if > OutPeriod then second coil used if available
/*19*/	uint8_t FanSpeed_1;
/*20*/	uint8_t FanSpeed_2;
/*21*/	uint8_t FanSpeed_3;
/*22*/	uint8_t FanCookerSpeed_1;
/*23*/	uint8_t FanCookerSpeed_2;
/*24*/	uint8_t FanCookerSpeed_3;
	//
/*25*/	uint8_t FanSpeeds;			// Number of speeds (1..FAN_IDXS)
/*26*/	uint8_t FanCookerSpeeds;	// Number of speeds (1..FAN_IDXS)
/*27*/	uint8_t _reserved[5];		// -> #0x20
/*32*/	uint8_t IRRemotes; // Total active remote controls
/*33*/	uint16_t IRCommandArray[IR_MAX_CONTROLS * IR_Keys_Total]; // type like IRHash
} __attribute__ ((packed));
struct _EEPROM EEMEM EEPROM;

#define FANS_IDX_EEPROM_OFFSET		&EEPROM.FanSpeed_1
#define GET_FANS_IDX_EEPROM(a)		(a - FANS_IDX_EEPROM_OFFSET + 1) // 1..FAN_IDXS*2

#define fCMD_Write					0x80 // EEPROM[Type] = Data, "fCMD_WriteStart" must be preceded, timeout - fCMD_Write_Timeout
#define fCMD_Read					0x40 // read MEM[Data] => Data, MEM: EEPROM, MAIN, PROGRAM
#define fCMD_Set					0xC0 // Set cmd, Type = cmd id, Data = cmd value
#define fCMD_WriteStart				0x2F
// fCMD +
#define fCMD_EEPROM					0x00	// EEPROM
#define fCMD_RAM					0x10	// RAM memory
#define fCMD_PROGMEM				0x20	// Program FLASH
#define fCMD_1b						0x01
#define fCMD_2b						0x02
#define fCMD_4b						0x03
#define fCMD_8b						0x04
#define fCMD_CStr					0x05	// #0 = ProgramID

#define Type_Set_Lamp				0	// Lamp ON/OFF, bit num
#define Type_Set_Fan				1	// Set Fan idx = Data
